var mungos  = require("mongoose");

mungos.connect("mongodb://localhost/app");

var misljenjaSema = new mungos.Schema({
    godina: Number,
    brojBiltena: Number,
    brojMisljenja: String,
    naslovMisljenja: String,
    misljenjeTekst: String
})

var Misljenje = mungos.model("Misljenje", misljenjaSema);

var novoMisljenje = new Misljenje({
    godina: 2018,
    brojBiltena: 4,
    brojMisljenja: '11-00-297/2018-04 од 13.4.2018. год.',
    naslovMisljenja:'  Pорески  третман  прихода  по  основу  продаје     пољопривредних  и  шумских  производа  и  услуга,  које     оствари  носилац  пољопривредног  газдинства,  односно     лице  које  доприносе  за  обавезно  социјално  осигурање     плаћа по решењу као осигураник по основу пољопривредне     делатности у складу са законом којим се уређују доприноси     за  обавезно  социјално  осигурање,  односно  лице  које  је     корисник пољопривредне пензије   ',
    misljenjeTekst: 'Одредбом члана 85. став 1. тачка 15) Закона о порезу     на доходак грађана („Сл. гласник РС“, бр. 24/01, 80/02, 80/02−    др. закон, 135/04, 62/06, 65/06−исправка, 31/09, 44/09, 18/10,     50/11,  91/11−УС,  93/12,  114/12−УС,  47/13,  48/13−исправка,    108/13,  57/14,  68/14−др.  закон,  112/15  и  113/17,  у  даљем    тексту:  Закон)  прописано  је  да  се  осталим  приходима,  у     смислу тог закона, сматрају и други приходи који по својој     природи чине доходак физичког лица, а нарочито приходи од     продаје пољопривредних и шумских производа и услуга, као и     узгајања и продаје печурака, пчелињег роја (пчела) и пужева.    Одредбом члана 85. став 12. Закона прописано је да     изузетно од става 1. тачке 15) овог члана, не опорезују се     приходи које физичко лице оствари од продаје пољопривредних     и  шумских  производа  и  услуга,  као  и  узгајања  и  продаје     печурака,  пчелињег  роја  (пчела)  и  пужева,  које  остваре     физичка лица: 1) носиоци пољопривредног газдинства;    2)  која  доприносе  за  обавезно  социјално  осигурање     плаћају по решењу као осигураници по основу пољопривредне     делатности, у складу са законом којим се уређују доприноси     за обавезно социјално осигурање;    3) корисници пољопривредне пензије.    Порез на други приход обрачунава се и плаћа по одбитку,     тако да за сваког обвезника и за сваки појединачно исплаћени     приход,  исплатилац  обрачунава,  обуставља  и  уплаћује  на     прописани  јединствени  уплатни  рачун  у  моменту  исплате     прихода,  у  складу  са  прописима  који  важе  на  дан  исплате     прихода,  осим  ако  овим  законом  није  друкчије  прописано     (члан 99. став 1. тачка 9) и члан 101. Закона).    Законом  о  шумама  („Сл.  гласник  РС“,  бр.  30/10,     93/12  и  89/15),  одредбом  члана  8.  тачка  23),  прописано  је     да шумски производи јесу сви производи шума и шумског     земљишта  (шумско  дрвеће  и  жбуње  и  сви  њихови  делови;     биомаса укупне шумске вегетације; цветови, семе, плодови,     кора дрвета, корење; маховина, папрат, трава, трска, цвеће,     лековито, ароматично и јестиво биље, друге биљке и њихови     делови; гљиве; мед, смола; шушањ, тресет и хумус; травнати     или пашњачки покривач; дивљач и остале животиње које живе     у шуми).    Имајући у виду наведено, када физичко лице носилац     пољопривредног  газдинства,  односно  лице  које  доприносе     за  обавезно  социјално  осигурање  плаћа  по  решењу  као     осигураник по основу пољопривредне делатности у складу     са законом којим се уређују доприноси за обавезно социјално     осигурање,  односно  лице  које  је  корисник  пољопривредне пензије, оствари приход од продаје шумских производа у које     спадају производи у смислу Закона о шумама, не плаћа се     порез на доходак грађана ни доприноси за обавезно социјално     осигурање. '



})
novoMisljenje.save(function(err, cat){
    if(err){
        console.log("Greska");
    }else{
        console.log("Uspesno upisanu u bazu podataka");
        console.log(cat)
    } 

});
Misljenje.find({},function(err, cat ){
    if(err){
        console.log("Greska")
    }else{
        console.log("Svi zapisi")
    }
})
Misljenje.create({
    ime:"Dalibor", 
    prezime: "Bogicevic",
    jmbg: 201211212121111212,
}, function(err, su){
    if(err){
        console.log("Greska");
    }else{
        console.log("USPEHHHH")
    }
})